In [1]:
#!pip install pandas

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(columns=['Name','Age','Height'])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [4]:
df.loc[0] = ['Allen','22','175']
df.loc[1] = ['Jack','25','180']
df.loc[2] = ['Marry','28','170']
df

    Name Age Height
0  Allen  22    175
1   Jack  25    180
2  Marry  28    170

In [5]:
df['Weight'] = ['75','80','60']
df

    Name Age Height Weight
0  Allen  22    175     75
1   Jack  25    180     80
2  Marry  28    170     60

In [6]:
df =df.drop(['Weight'], axis=1)

In [7]:
df.loc[0] = 'AAA'
df

    Name  Age Height
0    AAA  AAA    AAA
1   Jack   25    180
2  Marry   28    170

In [8]:
df['Height'] = '500'
df

    Name  Age Height
0    AAA  AAA    500
1   Jack   25    500
2  Marry   28    500

In [9]:
columns = ['Name', 'Age', 'Height']
data = [
    ['Ted','24','177'],
    ['Judy','27','183']
]

df2 = pd.DataFrame(data=data, columns=columns)
df2

   Name Age Height
0   Ted  24    177
1  Judy  27    183

In [10]:
df2 = df2.append(df)
df2

    Name  Age Height
0    Ted   24    177
1   Judy   27    183
0    AAA  AAA    500
1   Jack   25    500
2  Marry   28    500

In [11]:
df2= df2.reset_index()
df2

   index   Name  Age Height
0      0    Ted   24    177
1      1   Judy   27    183
2      0    AAA  AAA    500
3      1   Jack   25    500
4      2  Marry   28    500

In [12]:
df2.reset_index(drop=True)
df2

   index   Name  Age Height
0      0    Ted   24    177
1      1   Judy   27    183
2      0    AAA  AAA    500
3      1   Jack   25    500
4      2  Marry   28    500